; domain
(define (domain myDomain)
(:requirements :strips :equality :typing)
(:types 
Service - Thing
Capability
Design
BoronMaterial
PhosphorMaterial
SiliconMaterial
Material
Boolean
State
Service_str2 Service_pac1 Service_inv_kz Service_cle1 Service_des_ch Service_etc2 Service_act1 Service_etc1 Service_des_uk Service_str1 Service_inv_my Service_inv_jp Service_tes2 Service_act2 Service_inv_fr Service_des_us Service_inv_bo Service_exp2 Service_ass2 Service_cle2 Service_dev1 Service_inv_ru Service_imp1 Service_exp1 Service_imp2 Service_inv_us Service_coa1 Service_tes1 Service_dep1 Service_inv_tr Service_des_tw Service_pac2 Service_dev2 Service_inv_ma Service_inv_ar Service_inv_cn Service_dep2 Service_inv_no Service_inv_br Service_coa2 Service_inv_cl Service_ass1 Service_inv_kr - Service
)
(:predicates 
(provides ?srv - Service ?c - Capability) 
(taken ?o - Design ?b - Boolean)
(taken ?o - BoronMaterial ?b - Boolean)
(taken ?o - PhosphorMaterial ?b - Boolean)
(taken ?o - SiliconMaterial ?b - Boolean)
(taken ?o - Material ?b - Boolean)
(cleaned ?o - Material ?b - Boolean)
(deposited ?o - Material ?b - Boolean)
(coated ?o - Material ?b - Boolean)
(exposed ?o - Material ?b - Boolean)
(developed ?o - Material ?b - Boolean)
(etched ?o - Material ?b - Boolean)
(implanted ?o - Material ?b - Boolean)
(implanted ?o - BoronMaterial ?b - Boolean)
(implanted ?o - PhosphorMaterial ?b - Boolean)
(implanted ?o - SiliconMaterial ?b - Boolean)
(activated ?o - Material ?b - Boolean)
(stripped ?o - Material ?b - Boolean)
(assembled ?o - Material ?b - Boolean)
(tested ?o - Material ?b - Boolean)
(packed ?o - Material ?b - Boolean)
(status ?o - Service ?b - State)
)
(:functions (total-cost))
(:action strip_2
:parameters (?srv - Service_str2 ?w - Material)
:precondition (and (provides ?srv stripping) (activated ?w true) (stripped ?w false) (status ?srv available) )
:effect (and (stripped ?w true) (not(stripped ?w false)) (increase (total-cost) 3))
)
(:action pack_1
:parameters (?srv - Service_pac1 ?w - Material)
:precondition (and (provides ?srv packaging) (tested ?w true) (packed ?w false) (status ?srv available) )
:effect (and (packed ?w true) (not(packed ?w false)) (increase (total-cost) 1))
)
(:action take_boron_kz
:parameters (?srv - Service_inv_kz ?d - Design ?b - BoronMaterial)
:precondition (and (provides ?srv taking_boron) (taken ?d true) (taken ?b false) )
:effect (and (taken ?b true) (not(taken ?b false)) (increase (total-cost) 10))
)
(:action clean_1
:parameters (?srv - Service_cle1 ?d - Design ?b - BoronMaterial ?p - PhosphorMaterial ?s - SiliconMaterial ?w - Material)
:precondition (and (provides ?srv cleaning) (taken ?d true) (taken ?b true) (taken ?p true) (taken ?s true) (taken ?w true) (cleaned ?w false) (status ?srv available) )
:effect (and (cleaned ?w true) (not(cleaned ?w false)) (increase (total-cost) 1))
)
(:action take_design_cn
:parameters (?srv - Service_des_ch ?o - Design)
:precondition (and (provides ?srv taking_design) (taken ?o false) (status ?srv available) )
:effect (and (taken ?o true) (not(taken ?o false)) (increase (total-cost) 11))
)
(:action etch_2
:parameters (?srv - Service_etc2 ?w - Material)
:precondition (and (provides ?srv etching) (developed ?w true) (etched ?w false) (status ?srv available) )
:effect (and (etched ?w true) (not(etched ?w false)) (increase (total-cost) 5))
)
(:action activate_1
:parameters (?srv - Service_act1 ?b - BoronMaterial ?p - PhosphorMaterial ?s - SiliconMaterial ?w - Material)
:precondition (and (provides ?srv activating) (implanted ?b true) (implanted ?p true) (implanted ?s true) (implanted ?w true) (activated ?w false) (status ?srv available) )
:effect (and (activated ?w true) (not(activated ?w false)) (increase (total-cost) 1))
)
(:action etch_1
:parameters (?srv - Service_etc1 ?w - Material)
:precondition (and (provides ?srv etching) (developed ?w true) (etched ?w false) (status ?srv available) )
:effect (and (etched ?w true) (not(etched ?w false)) (increase (total-cost) 3))
)
(:action take_design_uk
:parameters (?srv - Service_des_uk ?o - Design)
:precondition (and (provides ?srv taking_design) (taken ?o false) (status ?srv available) )
:effect (and (taken ?o true) (not(taken ?o false)) (increase (total-cost) 6))
)
(:action strip_1
:parameters (?srv - Service_str1 ?w - Material)
:precondition (and (provides ?srv stripping) (activated ?w true) (stripped ?w false) (status ?srv available) )
:effect (and (stripped ?w true) (not(stripped ?w false)) (increase (total-cost) 3))
)
(:action take_silicon_my
:parameters (?srv - Service_inv_my ?d - Design ?s - SiliconMaterial)
:precondition (and (provides ?srv taking_silicon) (taken ?d true) (taken ?s false) )
:effect (and (taken ?s true) (not(taken ?s false)) (increase (total-cost) 14))
)
(:action take_wafer_jp
:parameters (?srv - Service_inv_jp ?d - Design ?w - Material)
:precondition (and (provides ?srv taking_wafer) (taken ?d true) (taken ?w false) )
:effect (and (taken ?w true) (not(taken ?w false)) (increase (total-cost) 10))
)
(:action test_2
:parameters (?srv - Service_tes2 ?w - Material)
:precondition (and (provides ?srv testing) (assembled ?w true) (tested ?w false) (status ?srv available) )
:effect (and (tested ?w true) (not(tested ?w false)) (increase (total-cost) 3))
)
(:action activate_2
:parameters (?srv - Service_act2 ?b - BoronMaterial ?p - PhosphorMaterial ?s - SiliconMaterial ?w - Material)
:precondition (and (provides ?srv activating) (implanted ?b true) (implanted ?p true) (implanted ?s true) (implanted ?w true) (activated ?w false) (status ?srv available) )
:effect (and (activated ?w true) (not(activated ?w false)) (increase (total-cost) 3))
)
(:action take_silicon_fr
:parameters (?srv - Service_inv_fr ?d - Design ?s - SiliconMaterial)
:precondition (and (provides ?srv taking_silicon) (taken ?d true) (taken ?s false) )
:effect (and (taken ?s true) (not(taken ?s false)) (increase (total-cost) 7))
)
(:action take_design_us
:parameters (?srv - Service_des_us ?o - Design)
:precondition (and (provides ?srv taking_design) (taken ?o false) (status ?srv available) )
:effect (and (taken ?o true) (not(taken ?o false)) (increase (total-cost) 1))
)
(:action take_boron_bo
:parameters (?srv - Service_inv_bo ?d - Design ?b - BoronMaterial)
:precondition (and (provides ?srv taking_boron) (taken ?d true) (taken ?b false) )
:effect (and (taken ?b true) (not(taken ?b false)) (increase (total-cost) 6))
)
(:action expose_2
:parameters (?srv - Service_exp2 ?w - Material)
:precondition (and (provides ?srv exposing) (coated ?w true) (exposed ?w false) (status ?srv available) )
:effect (and (exposed ?w true) (not(exposed ?w false)) (increase (total-cost) 1))
)
(:action assemble_2
:parameters (?srv - Service_ass2 ?w - Material)
:precondition (and (provides ?srv assembling) (stripped ?w true) (assembled ?w false) (status ?srv available) )
:effect (and (assembled ?w true) (not(assembled ?w false)) (increase (total-cost) 3))
)
(:action clean_2
:parameters (?srv - Service_cle2 ?d - Design ?b - BoronMaterial ?p - PhosphorMaterial ?s - SiliconMaterial ?w - Material)
:precondition (and (provides ?srv cleaning) (taken ?d true) (taken ?b true) (taken ?p true) (taken ?s true) (taken ?w true) (cleaned ?w false) (status ?srv available) )
:effect (and (cleaned ?w true) (not(cleaned ?w false)) (increase (total-cost) 3))
)
(:action delevop_1
:parameters (?srv - Service_dev1 ?w - Material)
:precondition (and (provides ?srv developing) (exposed ?w true) (developed ?w false) (status ?srv available) )
:effect (and (developed ?w true) (not(developed ?w false)) (increase (total-cost) 5))
)
(:action take_silicon_ru
:parameters (?srv - Service_inv_ru ?d - Design ?s - SiliconMaterial)
:precondition (and (provides ?srv taking_silicon) (taken ?d true) (taken ?s false) )
:effect (and (taken ?s true) (not(taken ?s false)) (increase (total-cost) 9))
)
(:action take_boron_ru
:parameters (?srv - Service_inv_ru ?d - Design ?b - BoronMaterial)
:precondition (and (provides ?srv taking_boron) (taken ?d true) (taken ?b false) )
:effect (and (taken ?b true) (not(taken ?b false)) (increase (total-cost) 9))
)
(:action implant_1
:parameters (?srv - Service_imp1 ?w - Material ?b - BoronMaterial ?p - PhosphorMaterial ?s - SiliconMaterial)
:precondition (and (provides ?srv implanting) (etched ?w true) (implanted ?w false) (implanted ?b false) (implanted ?p false) (implanted ?s false) (status ?srv available) )
:effect (and (implanted ?w true) (implanted ?b true) (implanted ?p true) (implanted ?s true) (not(implanted ?w false)) (not(implanted ?b false)) (not(implanted ?p false)) (not(implanted ?s false)) (increase (total-cost) 5))
)
(:action expose_1
:parameters (?srv - Service_exp1 ?w - Material)
:precondition (and (provides ?srv exposing) (coated ?w true) (exposed ?w false) (status ?srv available) )
:effect (and (exposed ?w true) (not(exposed ?w false)) (increase (total-cost) 3))
)
(:action implant_2
:parameters (?srv - Service_imp2 ?w - Material ?b - BoronMaterial ?p - PhosphorMaterial ?s - SiliconMaterial)
:precondition (and (provides ?srv implanting) (etched ?w true) (implanted ?w false) (implanted ?b false) (implanted ?p false) (implanted ?s false) (status ?srv available) )
:effect (and (implanted ?w true) (implanted ?b true) (implanted ?p true) (implanted ?s true) (not(implanted ?w false)) (not(implanted ?b false)) (not(implanted ?p false)) (not(implanted ?s false)) (increase (total-cost) 3))
)
(:action take_boron_us
:parameters (?srv - Service_inv_us ?d - Design ?b - BoronMaterial)
:precondition (and (provides ?srv taking_boron) (taken ?d true) (taken ?b false) )
:effect (and (taken ?b true) (not(taken ?b false)) (increase (total-cost) 1))
)
(:action take_phosphor_us
:parameters (?srv - Service_inv_us ?d - Design ?p - PhosphorMaterial)
:precondition (and (provides ?srv taking_phosphor) (taken ?d true) (taken ?p false) )
:effect (and (taken ?p true) (not(taken ?p false)) (increase (total-cost) 1))
)
(:action take_silicon_us
:parameters (?srv - Service_inv_us ?d - Design ?s - SiliconMaterial)
:precondition (and (provides ?srv taking_silicon) (taken ?d true) (taken ?s false) )
:effect (and (taken ?s true) (not(taken ?s false)) (increase (total-cost) 1))
)
(:action coat_1
:parameters (?srv - Service_coa1 ?w - Material)
:precondition (and (provides ?srv coating) (deposited ?w true) (coated ?w false) (status ?srv available) )
:effect (and (coated ?w true) (not(coated ?w false)) (increase (total-cost) 5))
)
(:action test_1
:parameters (?srv - Service_tes1 ?w - Material)
:precondition (and (provides ?srv testing) (assembled ?w true) (tested ?w false) (status ?srv available) )
:effect (and (tested ?w true) (not(tested ?w false)) (increase (total-cost) 5))
)
(:action deposit_1
:parameters (?srv - Service_dep1 ?w - Material)
:precondition (and (provides ?srv depositing) (cleaned ?w true) (deposited ?w false) (status ?srv available) )
:effect (and (deposited ?w true) (not(deposited ?w false)) (increase (total-cost) 5))
)
(:action take_boron_tr
:parameters (?srv - Service_inv_tr ?d - Design ?b - BoronMaterial)
:precondition (and (provides ?srv taking_boron) (taken ?d true) (taken ?b false) )
:effect (and (taken ?b true) (not(taken ?b false)) (increase (total-cost) 10))
)
(:action take_design_tw
:parameters (?srv - Service_des_tw ?o - Design)
:precondition (and (provides ?srv taking_design) (taken ?o false) (status ?srv available) )
:effect (and (taken ?o true) (not(taken ?o false)) (increase (total-cost) 12))
)
(:action pack_2
:parameters (?srv - Service_pac2 ?w - Material)
:precondition (and (provides ?srv packaging) (tested ?w true) (packed ?w false) (status ?srv available) )
:effect (and (packed ?w true) (not(packed ?w false)) (increase (total-cost) 3))
)
(:action delevop_2
:parameters (?srv - Service_dev2 ?w - Material)
:precondition (and (provides ?srv developing) (exposed ?w true) (developed ?w false) (status ?srv available) )
:effect (and (developed ?w true) (not(developed ?w false)) (increase (total-cost) 5))
)
(:action take_phosphor_ma
:parameters (?srv - Service_inv_ma ?d - Design ?p - PhosphorMaterial)
:precondition (and (provides ?srv taking_phosphor) (taken ?d true) (taken ?p false) )
:effect (and (taken ?p true) (not(taken ?p false)) (increase (total-cost) 7))
)
(:action take_boron_ar
:parameters (?srv - Service_inv_ar ?d - Design ?b - BoronMaterial)
:precondition (and (provides ?srv taking_boron) (taken ?d true) (taken ?b false) )
:effect (and (taken ?b true) (not(taken ?b false)) (increase (total-cost) 8))
)
(:action take_boron_cn
:parameters (?srv - Service_inv_cn ?d - Design ?b - BoronMaterial)
:precondition (and (provides ?srv taking_boron) (taken ?d true) (taken ?b false) )
:effect (and (taken ?b true) (not(taken ?b false)) (increase (total-cost) 11))
)
(:action take_silicon_ch
:parameters (?srv - Service_inv_cn ?d - Design ?s - SiliconMaterial)
:precondition (and (provides ?srv taking_silicon) (taken ?d true) (taken ?s false) )
:effect (and (taken ?s true) (not(taken ?s false)) (increase (total-cost) 11))
)
(:action take_phosphor_ch
:parameters (?srv - Service_inv_cn ?d - Design ?p - PhosphorMaterial)
:precondition (and (provides ?srv taking_phosphor) (taken ?d true) (taken ?p false) )
:effect (and (taken ?p true) (not(taken ?p false)) (increase (total-cost) 11))
)
(:action deposit_2
:parameters (?srv - Service_dep2 ?w - Material)
:precondition (and (provides ?srv depositing) (cleaned ?w true) (deposited ?w false) (status ?srv available) )
:effect (and (deposited ?w true) (not(deposited ?w false)) (increase (total-cost) 1))
)
(:action take_silicon_no
:parameters (?srv - Service_inv_no ?d - Design ?s - SiliconMaterial)
:precondition (and (provides ?srv taking_silicon) (taken ?d true) (taken ?s false) )
:effect (and (taken ?s true) (not(taken ?s false)) (increase (total-cost) 7))
)
(:action take_silicon_br
:parameters (?srv - Service_inv_br ?d - Design ?s - SiliconMaterial)
:precondition (and (provides ?srv taking_silicon) (taken ?d true) (taken ?s false) )
:effect (and (taken ?s true) (not(taken ?s false)) (increase (total-cost) 6))
)
(:action coat_2
:parameters (?srv - Service_coa2 ?w - Material)
:precondition (and (provides ?srv coating) (deposited ?w true) (coated ?w false) (status ?srv available) )
:effect (and (coated ?w true) (not(coated ?w false)) (increase (total-cost) 5))
)
(:action take_boron_cl
:parameters (?srv - Service_inv_cl ?d - Design ?b - BoronMaterial)
:precondition (and (provides ?srv taking_boron) (taken ?d true) (taken ?b false) )
:effect (and (taken ?b true) (not(taken ?b false)) (increase (total-cost) 7))
)
(:action assemble_1
:parameters (?srv - Service_ass1 ?w - Material)
:precondition (and (provides ?srv assembling) (stripped ?w true) (assembled ?w false) (status ?srv available) )
:effect (and (assembled ?w true) (not(assembled ?w false)) (increase (total-cost) 1))
)
(:action take_wafer_kr
:parameters (?srv - Service_inv_kr ?d - Design ?w - Material)
:precondition (and (provides ?srv taking_wafer) (taken ?d true) (taken ?w false) )
:effect (and (taken ?w true) (not(taken ?w false)) (increase (total-cost) 10))
)

)

; problem
(define (problem myProblem)
(:domain myDomain)
(:objects 
design - Design
boron - BoronMaterial
phosphor - PhosphorMaterial
silicon - SiliconMaterial
wafer - Material
true - Boolean
false - Boolean
available - State
broken - State
stripping - Capability
packaging - Capability
taking_boron - Capability
cleaning - Capability
taking_design - Capability
etching - Capability
activating - Capability
taking_silicon - Capability
taking_wafer - Capability
testing - Capability
exposing - Capability
assembling - Capability
developing - Capability
implanting - Capability
taking_phosphor - Capability
coating - Capability
depositing - Capability
stripper2usa - Service_str2
packager1usa - Service_pac1
inventorykazakhstan - Service_inv_kz
cleaner1usa - Service_cle1
designerchina - Service_des_ch
etcher2usa - Service_etc2
activator1usa - Service_act1
etcher1usa - Service_etc1
designeruk - Service_des_uk
stripper1usa - Service_str1
inventorymalaysia - Service_inv_my
inventoryjapan - Service_inv_jp
tester2usa - Service_tes2
activator2usa - Service_act2
inventoryfrance - Service_inv_fr
designerusa - Service_des_us
inventorybolivia - Service_inv_bo
exposer2usa - Service_exp2
assembler2usa - Service_ass2
cleaner2usa - Service_cle2
developer1usa - Service_dev1
inventoryrussia - Service_inv_ru
implanter1usa - Service_imp1
exposer1usa - Service_exp1
implanter2usa - Service_imp2
inventoryusa - Service_inv_us
coater1usa - Service_coa1
tester1usa - Service_tes1
depositer1usa - Service_dep1
inventoryturkey - Service_inv_tr
designertaiwan - Service_des_tw
packager2usa - Service_pac2
developer2usa - Service_dev2
inventorymorocco - Service_inv_ma
inventoryargentina - Service_inv_ar
inventorychina - Service_inv_cn
depositer2usa - Service_dep2
inventorynorway - Service_inv_no
inventorybrazil - Service_inv_br
coater2usa - Service_coa2
inventorychile - Service_inv_cl
assembler1usa - Service_ass1
inventorysouthkorea - Service_inv_kr
)
(:init 
(provides stripper2usa stripping)
(provides packager1usa packaging)
(provides inventorykazakhstan taking_boron)
(provides cleaner1usa cleaning)
(provides designerchina taking_design)
(provides etcher2usa etching)
(provides activator1usa activating)
(provides etcher1usa etching)
(provides designeruk taking_design)
(provides stripper1usa stripping)
(provides inventorymalaysia taking_silicon)
(provides inventoryjapan taking_wafer)
(provides tester2usa testing)
(provides activator2usa activating)
(provides inventoryfrance taking_silicon)
(provides designerusa taking_design)
(provides inventorybolivia taking_boron)
(provides exposer2usa exposing)
(provides assembler2usa assembling)
(provides cleaner2usa cleaning)
(provides developer1usa developing)
(provides inventoryrussia taking_silicon)
(provides inventoryrussia taking_boron)
(provides implanter1usa implanting)
(provides exposer1usa exposing)
(provides implanter2usa implanting)
(provides inventoryusa taking_boron)
(provides inventoryusa taking_phosphor)
(provides inventoryusa taking_silicon)
(provides coater1usa coating)
(provides tester1usa testing)
(provides depositer1usa depositing)
(provides inventoryturkey taking_boron)
(provides designertaiwan taking_design)
(provides packager2usa packaging)
(provides developer2usa developing)
(provides inventorymorocco taking_phosphor)
(provides inventoryargentina taking_boron)
(provides inventorychina taking_boron)
(provides inventorychina taking_silicon)
(provides inventorychina taking_phosphor)
(provides depositer2usa depositing)
(provides inventorynorway taking_silicon)
(provides inventorybrazil taking_silicon)
(provides coater2usa coating)
(provides inventorychile taking_boron)
(provides assembler1usa assembling)
(provides inventorysouthkorea taking_wafer)
(status stripper2usa available)
(status packager1usa available)
(status inventorykazakhstan available)
(status cleaner1usa available)
(status designerchina available)
(status etcher2usa available)
(status activator1usa available)
(status etcher1usa available)
(status designeruk available)
(status stripper1usa available)
(status inventorymalaysia available)
(status inventoryjapan available)
(status tester2usa available)
(status activator2usa available)
(status inventoryfrance available)
(status designerusa available)
(status inventorybolivia available)
(status exposer2usa available)
(status assembler2usa available)
(status cleaner2usa available)
(status developer1usa available)
(status inventoryrussia available)
(status implanter1usa available)
(taken phosphor false)
(implanted phosphor false)
(status exposer1usa available)
(status implanter2usa available)
(status inventoryusa available)
(status coater1usa available)
(status tester1usa available)
(status depositer1usa available)
(status inventoryturkey available)
(status designertaiwan available)
(taken design false)
(taken boron false)
(implanted boron false)
(status packager2usa available)
(status developer2usa available)
(status inventorymorocco available)
(status inventoryargentina available)
(status inventorychina available)
(status depositer2usa available)
(status inventorynorway available)
(taken wafer false)
(cleaned wafer false)
(deposited wafer false)
(coated wafer false)
(exposed wafer false)
(developed wafer false)
(etched wafer false)
(implanted wafer false)
(activated wafer false)
(stripped wafer false)
(assembled wafer false)
(tested wafer false)
(packed wafer false)
(status inventorybrazil available)
(status coater2usa available)
(status inventorychile available)
(taken silicon false)
(implanted silicon false)
(status assembler1usa available)
(status inventorysouthkorea available)
(= (total-cost) 0)
)
(:goal 
(and 
(packed wafer true)
)
)
(:metric minimize (total-cost))

)

; plan
1. (take_design_us designerusa design)
   deleted: (taken design false)
   added: (taken design true)
   goals met: 0 of 1
2. (take_wafer_jp inventoryjapan design wafer)
   deleted: (taken wafer false)
   added: (taken wafer true)
   goals met: 0 of 1
3. (take_silicon_us inventoryusa design silicon)
   deleted: (taken silicon false)
   added: (taken silicon true)
   goals met: 0 of 1
4. (take_phosphor_us inventoryusa design phosphor)
   deleted: (taken phosphor false)
   added: (taken phosphor true)
   goals met: 0 of 1
5. (take_boron_us inventoryusa design boron)
   deleted: (taken boron false)
   added: (taken boron true)
   goals met: 0 of 1
6. (clean_1 cleaner1usa design boron phosphor silicon wafer)
   deleted: (cleaned wafer false)
   added: (cleaned wafer true)
   goals met: 0 of 1
7. (deposit_2 depositer2usa wafer)
   deleted: (deposited wafer false)
   added: (deposited wafer true)
   goals met: 0 of 1
8. (coat_1 coater1usa wafer)
   deleted: (coated wafer false)
   added: (coated wafer true)
   goals met: 0 of 1
9. (expose_2 exposer2usa wafer)
   deleted: (exposed wafer false)
   added: (exposed wafer true)
   goals met: 0 of 1
10. (delevop_1 developer1usa wafer)
   deleted: (developed wafer false)
   added: (developed wafer true)
   goals met: 0 of 1
11. (etch_1 etcher1usa wafer)
   deleted: (etched wafer false)
   added: (etched wafer true)
   goals met: 0 of 1
12. (implant_2 implanter2usa wafer boron phosphor silicon)
   deleted: (implanted wafer false) (implanted boron false) (implanted phosphor false) (implanted silicon false)
   added: (implanted wafer true) (implanted boron true) (implanted phosphor true) (implanted silicon true)
   goals met: 0 of 1
13. (activate_1 activator1usa boron phosphor silicon wafer)
   deleted: (activated wafer false)
   added: (activated wafer true)
   goals met: 0 of 1
14. (strip_1 stripper1usa wafer)
   deleted: (stripped wafer false)
   added: (stripped wafer true)
   goals met: 0 of 1
15. (assemble_1 assembler1usa wafer)
   deleted: (assembled wafer false)
   added: (assembled wafer true)
   goals met: 0 of 1
16. (test_2 tester2usa wafer)
   deleted: (tested wafer false)
   added: (tested wafer true)
   goals met: 0 of 1
17. (pack_1 packager1usa wafer)
   deleted: (packed wafer false)
   added: (packed wafer true)
   goals met: 1 of 1
